# Author:"lvfangting"
# Date:2022/6/3 12:54
# encoding:"utf-8"

# 抖音账号
phone = ""
passwd = "5206"

# 字典-所有弹窗及对应的xpath相对路径
dict_popup = {
    "个人信息保护指引": "//*[@text = '同意']",                    # 个人信息保护指引--同意
    "允许抖音获取设备信息": "//*[@text = '始终允许']",              # 允许抖音获取设备信息--允许
    "允许抖音获取位置信息": "//*[@text = '仅使用期间允许']",         # 允许抖音获取位置信息--允许
    "允许抖音拍摄照片和录制视频": "//*[@text = '仅使用期间允许']",    # 允许抖音拍摄照片和视频--允许
    "青少年弹窗": "//*[@text = '我知道了']",                     # 是否开启青少年模式--我知道了(不开启)
    "登录弹窗-立即登录": "//*[@text = '立即登录']",                # 登录弹窗--立即登录
    "登录弹窗-关闭": "//*[@content-desc = '关闭，按钮']"           # 登录弹窗--关闭
    }



# 字典-登录失败原因及xpath相对路径
loginFailureReason = {
    "手机号填写错误": "//*[@text = '手机号填写错误']",
    "请输入正确的手机号": "//*[@text = '请输入正确的手机号']",
    "请输入密码": "//*[@text = '请输入密码']",
    "账号密码错误": "//*[@text= '帐号或密码错误']",
}